[
  {
    "id": 1,
    "title": "Capital City Election Updates",
    "shortDescription": "Latest developments from the national election.",
    "fullDescription": "The national election has reached a crucial stage with parties campaigning aggressively across the country. Citizens are eagerly following developments as candidates outline their policies and plans for the upcoming term. Voter engagement has increased, with young voters showing particular interest in issues like education, healthcare, and job creation. Debate events have highlighted the differences between major parties, particularly on economic reforms and social welfare programs. Polling stations have been set up in urban and rural areas, with additional security measures to ensure a fair voting process. Experts are analyzing voter sentiment and predicting possible outcomes based on current trends, while news channels continue to provide live coverage. In addition to political rallies, social media campaigns have played a key role in shaping public opinion. Analysts are noting shifts in traditional voting patterns, especially among undecided voters, which could impact the final results. Overall, the election period has created a heightened sense of civic responsibility and public discourse across the nation, highlighting the importance of informed decision-making and transparent governance practices.",
    "image": "https://via.placeholder.com/400x250",
    "category": "National",
    "subCategory": ["Politics", "Government"],
    "cardType": "verticalImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-05"
  },
  {
    "id": 2,
    "title": "Tech Innovations in AI",
    "shortDescription": "Artificial Intelligence is reshaping industries in 2026.",
    "fullDescription": "Artificial Intelligence has emerged as a transformative force in multiple industries around the world. From healthcare to finance, AI-powered solutions are enabling faster decision-making, predictive analytics, and automation of routine tasks. In healthcare, AI algorithms assist in diagnostic imaging, patient data analysis, and personalized treatment recommendations, improving patient outcomes. Financial institutions use AI to detect fraud, assess credit risk, and optimize investment strategies. Startups and established tech companies alike are exploring AI-driven solutions for logistics, supply chain management, and customer service automation. With the rise of natural language processing, virtual assistants and chatbots are now capable of understanding complex queries and providing human-like responses. Ethical considerations have become central to AI development, with policymakers focusing on transparency, bias mitigation, and data privacy. Academic institutions are expanding AI research programs, while global tech conferences showcase innovative applications. Overall, AI is redefining how businesses operate, creating new opportunities, and presenting unique challenges for governance and regulation, signaling a future in which intelligent systems will be increasingly integrated into daily life.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Technology",
    "subCategory": ["AI", "Startups", "Gadgets"],
    "cardType": "coverImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-04"
  },
  {
    "id": 3,
    "title": "Football League Finals Highlights",
    "shortDescription": "The championship match delivered thrilling moments.",
    "fullDescription": "The finals of the national football league concluded with an intense showdown between two top teams. Fans across the country were glued to live broadcasts as every goal, tackle, and strategy unfolded on the field. The opening minutes set a high pace, with both teams demonstrating exceptional skill, coordination, and tactical awareness. Star players executed precise passes, while goalkeepers made remarkable saves, keeping the audience on edge. Off the field, analysts discussed team formations, substitutions, and potential game-changers. Social media platforms were abuzz with live commentary, highlights, and fan reactions. Coaches emphasized teamwork and resilience, reflecting months of preparation and training. Ultimately, the match concluded with a narrow victory, demonstrating the importance of perseverance and strategic play. Post-match interviews highlighted players’ dedication, fans’ enthusiasm, and the league’s role in promoting sportsmanship and national pride. This season’s finale will be remembered for its dramatic moments and the celebration of football culture across the nation.",
    "image": "https://via.placeholder.com/400x250",
    "category": "Sports",
    "subCategory": ["Football", "League"],
    "cardType": "sideImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-03"
  },
  {
    "id": 4,
    "title": "Olympic Games Preparations",
    "shortDescription": "Athletes gear up for the upcoming Olympics.",
    "fullDescription": "With the upcoming Olympic Games approaching, athletes from various countries are intensifying their training regimens to ensure peak performance. Sports federations are organizing trials, qualification events, and specialized coaching sessions to identify and nurture talent. The focus is on endurance, strategy, technical skills, and mental preparedness, as the global stage demands excellence. Nutritionists and sports scientists collaborate to design optimal diet plans, recovery routines, and performance monitoring techniques. Meanwhile, venues are being prepared with international standards, ensuring safety, accessibility, and top-quality facilities. Media coverage has increased, highlighting athletes’ journeys, challenges, and inspirational stories. Fans worldwide are following updates closely, celebrating achievements and supporting their favorite competitors. The preparation phase underscores the dedication, discipline, and teamwork required to compete at the highest level, as countries aim for medals, records, and recognition. Overall, the Olympics exemplify unity, sportsmanship, and the pursuit of excellence, motivating the next generation of athletes and inspiring a global audience.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Sports",
    "subCategory": ["Olympics", "International"],
    "cardType": "verticalImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-02"
  },
  {
    "id": 5,
    "title": "New Tech Gadgets Launched",
    "shortDescription": "The latest smartphones and devices are now available.",
    "fullDescription": "This year's technology expo showcased a range of innovative gadgets designed to enhance everyday life and productivity. Smartphones now feature improved processors, AI-powered cameras, and extended battery life, catering to the demands of modern users. Wearable devices, including smartwatches and fitness trackers, offer advanced health monitoring, integration with smart home systems, and personalized alerts. Virtual reality and augmented reality gadgets are increasingly accessible, providing immersive experiences in gaming, education, and professional training. Tech companies are emphasizing sustainability, with eco-friendly materials and energy-efficient designs. Startups are introducing smart appliances, robotics, and AI-driven assistants to simplify routine tasks. Consumers are responding enthusiastically, comparing features, pricing, and compatibility. Overall, the expo highlighted the rapid pace of technological advancement, the integration of AI into consumer products, and the growing trend of connected devices transforming lifestyles and work environments.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Technology",
    "subCategory": ["Gadgets", "Mobile", "Wearables"],
    "cardType": "textOnlyCard",
    "isFeatured": false,
    "publishedDate": "2026-01-01"
  },
  
  {
    "id": 6,
    "title": "International Summit on Climate",
    "shortDescription": "World leaders discuss global climate policies.",
    "fullDescription": "The international summit gathered leaders to deliberate on sustainable energy, emission reductions, and climate agreements. Experts presented data-driven strategies to mitigate climate change while balancing economic growth. Delegates discussed renewable energy projects, carbon trading mechanisms, and international cooperation. Panel sessions addressed the urgency of adopting eco-friendly policies and technologies. NGOs and environmental organizations highlighted community-level initiatives and the importance of public awareness. The discussions emphasized adaptation strategies for vulnerable nations, sustainable urban development, and the integration of green technologies across sectors. In addition, youth representatives and activist groups shared innovative solutions, pushing for actionable commitments. Media coverage focused on debates over funding, accountability, and scientific consensus, reflecting global interest in climate responsibility. Overall, the summit showcased collaboration, negotiation, and the global commitment to addressing climate challenges through structured policies, technological advancements, and inclusive stakeholder engagement.",
    "image": "https://via.placeholder.com/400x250",
    "category": "International",
    "subCategory": ["Environment", "Politics"],
    "cardType": "coverImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-04"
  },
  {
    "id": 7,
    "title": "Stock Market Trends Today",
    "shortDescription": "Investors monitor the fluctuations in the market.",
    "fullDescription": "Today, the stock market experienced a mix of gains and losses across sectors. Technology stocks surged, driven by new product launches and positive earnings reports, while traditional manufacturing stocks showed minor declines. Analysts highlighted trends such as investor sentiment, geopolitical factors, and the impact of recent policy changes. Trading volume was higher than usual, indicating active participation from institutional and retail investors. Financial advisors recommended diversification strategies, with a focus on long-term growth. Market commentary emphasized the importance of monitoring international markets, currency fluctuations, and commodity prices to make informed investment decisions. Additionally, discussions around emerging markets revealed opportunities in renewable energy, infrastructure, and digital services. The day concluded with a cautious optimism as investors awaited upcoming economic indicators, corporate earnings, and central bank announcements. Overall, the market reflected a dynamic environment shaped by global events, investor psychology, and economic developments, demonstrating the need for strategic decision-making.",
    "image": "https://via.placeholder.com/400x200",
    "category": "National",
    "subCategory": ["Finance", "Economy"],
    "cardType": "sideImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-03"
  },
  {
    "id": 8,
    "title": "International Space Mission Success",
    "shortDescription": "A major milestone in global space exploration.",
    "fullDescription": "The international team successfully launched a satellite mission aimed at scientific research and global communication improvements. The launch required meticulous planning, coordination across countries, and adherence to safety protocols. Engineers and scientists monitored telemetry data, ensuring that each stage of the mission proceeded as expected. The satellite carries instruments designed for atmospheric studies, environmental monitoring, and data relay services. Collaboration among space agencies highlighted the importance of international partnerships in advancing technology and knowledge. The project also involved public engagement campaigns, educational programs, and media outreach to showcase the achievements and inspire future generations. Experts analyzed orbital trajectories, fuel efficiency, and system redundancies, ensuring optimal performance and longevity. The success of this mission sets a precedent for future cooperative ventures in space exploration, scientific innovation, and global technological advancement, illustrating how careful planning and expertise can achieve milestones that benefit humanity as a whole.",
    "image": "https://via.placeholder.com/400x250",
    "category": "International",
    "subCategory": ["Science", "Space", "Technology"],
    "cardType": "verticalImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-02"
  },
  {
    "id": 9,
    "title": "National Education Policy Update",
    "shortDescription": "Government announces reforms in education.",
    "fullDescription": "The government unveiled a comprehensive update to the national education policy, focusing on modernizing curricula, improving teacher training, and integrating technology in classrooms. The reform aims to enhance critical thinking, problem-solving skills, and vocational training among students. Schools will adopt innovative teaching methods, including digital learning platforms, interactive content, and experiential projects. Funding allocations will support underprivileged regions, ensuring equitable access to quality education. Policy-makers emphasized collaboration between educational institutions, industry, and research organizations to align skills with market demands. Public consultations and stakeholder feedback have influenced the framework, fostering transparency and inclusivity. The policy also addresses higher education, research grants, and scholarship programs to nurture talent and innovation. Experts predict that these reforms will boost literacy, employment readiness, and national competitiveness. Continuous monitoring, periodic assessments, and teacher support programs will ensure successful implementation, creating a dynamic and forward-looking education system capable of meeting future challenges.",
    "image": "https://via.placeholder.com/400x200",
    "category": "National",
    "subCategory": ["Education", "Policy"],
    "cardType": "textOnlyCard",
    "isFeatured": true,
    "publishedDate": "2026-01-01"
  },
  {
    "id": 10,
    "title": "Global Health Conference Highlights",
    "shortDescription": "Medical experts share breakthroughs in healthcare.",
    "fullDescription": "The Global Health Conference brought together experts, researchers, and policymakers to discuss the latest breakthroughs in healthcare, medical technology, and public health initiatives. Key topics included vaccine development, disease prevention strategies, digital health platforms, and the integration of AI in diagnostics. Panel discussions addressed challenges in delivering healthcare to remote regions, managing pandemics, and ensuring equitable access to treatment. Innovations in medical devices, telemedicine, and data analytics were highlighted as transformative tools for improving patient outcomes. Collaborative projects between universities, research institutions, and healthcare providers emphasized knowledge sharing and resource optimization. Attendees engaged in workshops, case studies, and live demonstrations, gaining insights into emerging trends and best practices. The conference underscored the importance of global cooperation, scientific research, and technological innovation in building resilient healthcare systems capable of addressing current and future health challenges.",
    "image": "https://via.placeholder.com/400x250",
    "category": "International",
    "subCategory": ["Health", "Science", "Policy"],
    "cardType": "coverImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-03"
  },
  {
    "id": 11,
    "title": "Basketball Championship Recap",
    "shortDescription": "The finals showcased remarkable skill and teamwork.",
    "fullDescription": "The national basketball championship concluded with an intense finals match, demonstrating high-level skill, strategy, and athleticism. Teams prepared rigorously for months, focusing on drills, fitness, and coordination. The game featured fast breaks, accurate shooting, and tactical plays that thrilled spectators. Star players executed precision passes and defensive maneuvers, while coaches adjusted strategies to respond to the opposing team’s strengths. Fans attended in large numbers, creating an electrifying atmosphere, while media outlets provided extensive coverage. Post-game analysis highlighted critical moments that influenced the outcome, including pivotal turnovers and clutch performances. Interviews with players and coaches emphasized teamwork, resilience, and sportsmanship, reflecting the dedication required at elite levels. The championship not only celebrated individual talent but also highlighted the importance of collaboration, discipline, and competitive spirit. Overall, the event contributed to promoting basketball culture nationally and inspiring young athletes to pursue sports.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Sports",
    "subCategory": ["Basketball", "League"],
    "cardType": "sideImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-02"
  },
  {
    "id": 12,
    "title": "Cybersecurity Threats in 2026",
    "shortDescription": "Experts warn about rising digital risks.",
    "fullDescription": "With the growing reliance on digital infrastructure, cybersecurity threats have become increasingly sophisticated and frequent. Experts warn that malware, ransomware, phishing attacks, and data breaches pose significant risks to businesses, governments, and individuals. Organizations are investing in advanced security measures, including AI-based monitoring, threat intelligence platforms, and employee training programs. Cybersecurity policies are being updated to reflect evolving regulations, compliance requirements, and international standards. Public awareness campaigns emphasize safe online practices, password management, and secure communication channels. Collaboration between technology companies, security agencies, and academic researchers is critical to developing effective defense mechanisms. The evolving threat landscape requires continuous vigilance, adaptive strategies, and proactive risk assessment to mitigate potential damages. Analysts predict that 2026 will see a surge in initiatives aimed at enhancing resilience, detecting threats early, and safeguarding sensitive information across sectors.",
    "image": "https://via.placeholder.com/400x250",
    "category": "Technology",
    "subCategory": ["Cybersecurity", "AI", "Digital"],
    "cardType": "verticalImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-01"
  },
  {
    "id": 13,
    "title": "National Transportation Reforms",
    "shortDescription": "Government plans to modernize transport infrastructure.",
    "fullDescription": "The national government announced a series of transportation reforms aimed at improving efficiency, safety, and sustainability. Key initiatives include upgrading highways, introducing smart traffic management systems, and expanding public transport networks. Urban areas will benefit from metro expansions, intelligent signaling, and eco-friendly buses. Rural regions will see improved road connectivity, bridges, and safety measures. The reforms also focus on adopting renewable energy for transportation, including electric vehicles and charging infrastructure. Collaborative projects with private companies aim to integrate technology solutions, reduce congestion, and enhance commuter experience. Policy adjustments address vehicle regulations, licensing procedures, and incentives for sustainable practices. Public consultations are being conducted to ensure community engagement and transparency. Analysts believe these measures will promote economic growth, reduce environmental impact, and improve the quality of life for citizens, reflecting a forward-looking approach to national transportation planning.",
    "image": "https://via.placeholder.com/400x200",
    "category": "National",
    "subCategory": ["Infrastructure", "Policy"],
    "cardType": "textOnlyCard",
    "isFeatured": true,
    "publishedDate": "2026-01-05"
  },
  {
    "id": 14,
    "title": "Tech Startup Ecosystem Expands",
    "shortDescription": "Entrepreneurs drive innovation across sectors.",
    "fullDescription": "The technology startup ecosystem continues to grow rapidly, fueled by innovative ideas, venture capital, and government support. Startups are addressing challenges in healthcare, fintech, education, and logistics, providing solutions that leverage AI, blockchain, and IoT technologies. Incubators and accelerators offer mentorship, networking, and funding opportunities to help entrepreneurs scale their businesses. Collaboration between academic institutions and industry experts fosters research-driven product development. Investors are increasingly focusing on scalable business models, market potential, and sustainability. Events, conferences, and pitch competitions provide platforms for startups to showcase their solutions, gain visibility, and attract strategic partnerships. The expansion of co-working spaces, digital infrastructure, and online communities strengthens the ecosystem, promoting knowledge sharing and collaboration. Overall, the growth of startups is contributing to economic development, job creation, and technological advancement, reflecting a dynamic and innovative business environment.",
    "image": "https://via.placeholder.com/400x250",
    "category": "Technology",
    "subCategory": ["Startups", "Innovation"],
    "cardType": "coverImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-03"
  },
  {
    "id": 15,
    "title": "National Healthcare Initiative Launched",
    "shortDescription": "New programs aim to improve public health services.",
    "fullDescription": "The government launched a comprehensive healthcare initiative to enhance accessibility, quality, and efficiency of medical services nationwide. The program includes establishing new clinics, upgrading hospitals, and integrating telemedicine solutions to reach remote areas. Healthcare professionals are receiving specialized training to improve patient care and operational effectiveness. Preventive health campaigns, vaccination drives, and community outreach programs aim to reduce the prevalence of common diseases and promote wellness. Data analytics and digital health platforms are being employed to monitor health indicators, optimize resource allocation, and track program outcomes. Collaboration with NGOs and international organizations ensures adherence to best practices and innovative approaches. The initiative also emphasizes mental health awareness, nutritional programs, and maternal care, addressing a holistic approach to well-being. Overall, the project reflects a commitment to public health, equitable service delivery, and sustainable healthcare development, promising improved outcomes for citizens across the nation.",
    "image": "https://via.placeholder.com/400x200",
    "category": "National",
    "subCategory": ["Health", "Policy"],
    "cardType": "verticalImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-02"
  },
  {
    "id": 16,
    "title": "International Trade Talks Progress",
    "shortDescription": "Countries negotiate new trade agreements.",
    "fullDescription": "Diplomats and trade representatives gathered to advance negotiations on bilateral and multilateral trade agreements. Discussions focused on tariffs, import-export regulations, intellectual property rights, and dispute resolution mechanisms. Delegates presented economic data, market trends, and sector-specific insights to support their positions. Special emphasis was placed on technology transfer, sustainable trade practices, and fair labor standards. Workshops and breakout sessions facilitated dialogue on complex topics, including cross-border investment, customs procedures, and trade facilitation measures. Analysts noted that successful negotiations could boost global economic growth, increase market access, and strengthen international cooperation. Public statements and press releases highlighted commitment to transparency, mutual benefits, and long-term strategic partnerships. Overall, the trade talks reflect the interconnected nature of modern economies and the importance of diplomacy, negotiation skills, and evidence-based policy-making in shaping global commerce.",
    "image": "https://via.placeholder.com/400x250",
    "category": "International",
    "subCategory": ["Economy", "Politics"],
    "cardType": "textOnlyCard",
    "isFeatured": true,
    "publishedDate": "2026-01-01"
  },
  {
    "id": 17,
    "title": "Cricket World Cup Qualifiers",
    "shortDescription": "Teams compete for a spot in the world championship.",
    "fullDescription": "The Cricket World Cup qualifiers witnessed fierce competition among national teams striving for a place in the main tournament. Matches were held across multiple venues, with fans passionately supporting their teams. Players displayed exceptional batting, bowling, and fielding skills, reflecting months of training and strategic preparation. Coaches emphasized game tactics, fitness, and adaptability to varying pitch conditions. Umpires ensured fair play, applying international rules consistently. Analysts provided in-depth commentary on performance trends, individual achievements, and potential match-winning moments. The qualifiers also highlighted emerging talent, with younger players gaining recognition for their contributions. Media coverage amplified fan engagement, social media discussions, and sponsorship visibility. Ultimately, the event underscored the importance of teamwork, resilience, and sportsmanship, while setting the stage for a thrilling Cricket World Cup experience.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Sports",
    "subCategory": ["Cricket", "International"],
    "cardType": "coverImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-05"
  },
  {
    "id": 18,
    "title": "National Renewable Energy Policy",
    "shortDescription": "Government outlines plans for sustainable energy.",
    "fullDescription": "The national government introduced a comprehensive renewable energy policy aimed at reducing carbon emissions, promoting clean energy, and fostering technological innovation. The policy sets targets for solar, wind, hydro, and bioenergy generation, alongside incentives for private sector investment. Research and development programs will focus on efficiency improvements, storage solutions, and grid integration. Collaboration with international partners ensures adoption of best practices and access to advanced technologies. Public awareness campaigns encourage energy conservation, sustainable practices, and community participation. Regulatory frameworks will facilitate project approvals, monitoring, and compliance, ensuring transparency and accountability. Experts anticipate that the policy will create employment opportunities, stimulate economic growth, and contribute to environmental sustainability. Overall, the initiative reflects a forward-thinking approach to energy management, balancing ecological responsibility with national development objectives.",
    "image": "https://via.placeholder.com/400x250",
    "category": "National",
    "subCategory": ["Environment", "Policy"],
    "cardType": "verticalImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-03"
  },
  {
    "id": 19,
    "title": "AI in Healthcare Innovations",
    "shortDescription": "Artificial Intelligence enhances medical diagnostics.",
    "fullDescription": "Healthcare institutions are increasingly adopting artificial intelligence to improve diagnostic accuracy, streamline workflows, and optimize patient care. AI algorithms assist in medical imaging, predictive analytics, patient monitoring, and personalized treatment planning. Hospitals and clinics integrate AI-driven decision support systems, enabling clinicians to make evidence-based decisions faster. Startups and tech companies are developing AI solutions that focus on chronic disease management, early detection of illnesses, and resource optimization. Ethical considerations, including data privacy, algorithmic bias, and transparency, remain central to AI implementation. Training programs for medical professionals emphasize collaboration between humans and intelligent systems to enhance outcomes. Conferences and publications highlight research breakthroughs, case studies, and successful pilot programs demonstrating measurable improvements. Overall, AI adoption in healthcare is transforming patient experiences, increasing efficiency, and shaping the future of medical technology.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Technology",
    "subCategory": ["AI", "Health", "Innovation"],
    "cardType": "textOnlyCard",
    "isFeatured": false,
    "publishedDate": "2026-01-02"
  },
  {
    "id": 20,
    "title": "International Diplomatic Relations Strengthened",
    "shortDescription": "Nations sign agreements to enhance cooperation.",
    "fullDescription": "Recent diplomatic meetings resulted in multiple agreements aimed at strengthening international relations, trade cooperation, and cultural exchange programs. Leaders discussed policies on security, economic collaboration, technological partnerships, and educational initiatives. Delegates emphasized transparency, mutual respect, and conflict resolution mechanisms to foster trust and stability. Joint projects in infrastructure, research, and energy were planned, with commitments to sustainable development goals. Public diplomacy efforts include exchange programs, media outreach, and cultural events to enhance people-to-people connections. Analysts suggest that these agreements will improve bilateral and multilateral engagement, promote regional stability, and encourage investment opportunities. The meetings demonstrated the importance of dialogue, negotiation skills, and strategic planning in international relations, highlighting how diplomacy shapes global interactions and long-term cooperation.",
    "image": "https://via.placeholder.com/400x250",
    "category": "International",
    "subCategory": ["Politics", "Economy"],
    "cardType": "coverImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-01"
  },
  {
    "id": 21,
    "title": "Olympic Qualifiers Round-Up",
    "shortDescription": "Athletes compete for spots in the Olympics.",
    "fullDescription": "The Olympic qualifiers showcased remarkable performances from athletes across multiple sports. Competitors demonstrated endurance, agility, and strategic skill to secure positions for the main Olympic event. National sports federations closely monitored results, ensuring that top-performing athletes meet international standards. Training camps focused on refining techniques, mental conditioning, and adaptability to diverse competitive environments. Media coverage highlighted inspiring stories of perseverance, talent, and dedication, capturing the attention of fans and sports enthusiasts. Coaches emphasized the importance of preparation, nutrition, and teamwork, while analysts provided insights into potential medal prospects. Social media engagement increased, fostering global interest and support for athletes. The qualifiers exemplified excellence, commitment, and the spirit of sportsmanship, setting the stage for a highly anticipated Olympic Games.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Sports",
    "subCategory": ["Olympics", "International"],
    "cardType": "sideImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-05"
  },
  {
    "id": 22,
    "title": "Global Tech Conference 2026",
    "shortDescription": "Innovators present next-generation solutions.",
    "fullDescription": "The Global Tech Conference 2026 brought together innovators, entrepreneurs, and industry leaders to present and discuss emerging technologies. Key themes included artificial intelligence, blockchain, cybersecurity, and green tech. Attendees participated in workshops, panel discussions, and product demonstrations to explore real-world applications. Startups showcased prototypes and solutions designed to address pressing challenges in healthcare, finance, education, and logistics. Networking sessions facilitated collaborations, partnerships, and knowledge sharing among participants. Speakers emphasized sustainable innovation, ethical technology use, and scalability of solutions for global impact. The conference highlighted the accelerating pace of technological advancement and the importance of cross-sector collaboration to harness innovation effectively. Overall, the event served as a hub for learning, inspiration, and connecting global tech ecosystems to drive progress and solve contemporary problems.",
    "image": "https://via.placeholder.com/400x250",
    "category": "Technology",
    "subCategory": ["Innovation", "Startups", "AI"],
    "cardType": "verticalImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-04"
  },
  {
    "id": 23,
    "title": "National Disaster Preparedness Plan",
    "shortDescription": "Government outlines measures to handle emergencies.",
    "fullDescription": "In response to increasing natural disasters, the government unveiled a comprehensive disaster preparedness plan to improve emergency response, community awareness, and resilience. The plan includes early warning systems, evacuation protocols, emergency shelters, and resource management strategies. Training programs for local authorities, first responders, and volunteers focus on risk assessment, disaster mitigation, and efficient coordination during emergencies. Public education campaigns aim to increase awareness about hazards such as floods, earthquakes, and cyclones, while emphasizing individual and community preparedness. Collaboration with NGOs, international agencies, and research institutions ensures that best practices are implemented and updated regularly. Simulation exercises, drills, and continuous monitoring help identify gaps and improve response strategies. The initiative reflects a proactive approach to safeguarding citizens, minimizing damage, and enhancing recovery capabilities, emphasizing the importance of planning, coordination, and community engagement in disaster management.",
    "image": "https://via.placeholder.com/400x200",
    "category": "National",
    "subCategory": ["Safety", "Policy"],
    "cardType": "textOnlyCard",
    "isFeatured": false,
    "publishedDate": "2026-01-03"
  },
  {
    "id": 24,
    "title": "International Trade Policy Changes",
    "shortDescription": "New policies aim to boost cross-border commerce.",
    "fullDescription": "Global trade authorities have announced policy changes designed to streamline cross-border commerce, enhance market access, and encourage sustainable economic growth. Adjustments include tariff revisions, import-export simplifications, and updated customs procedures. Businesses are adapting to new regulations while taking advantage of incentives to expand operations internationally. Economic analysts are assessing the impact of these changes on emerging markets, supply chains, and trade balances. Workshops and training sessions are organized to help companies comply with updated standards, while negotiations with international partners ensure mutually beneficial agreements. Technology-enabled trade platforms are being integrated to improve transparency, efficiency, and monitoring. The policy reforms are expected to foster innovation, investment, and competitive advantages for participating nations. Overall, these changes demonstrate the importance of proactive governance, strategic planning, and collaboration in facilitating global commerce, benefiting businesses and consumers alike.",
    "image": "https://via.placeholder.com/400x250",
    "category": "International",
    "subCategory": ["Economy", "Policy"],
    "cardType": "coverImageCard",
    "isFeatured": true,
    "publishedDate": "2026-01-02"
  },
  {
    "id": 25,
    "title": "Sports Technology Advancements",
    "shortDescription": "New tools enhance athlete performance and training.",
    "fullDescription": "Recent advancements in sports technology are revolutionizing training, performance monitoring, and injury prevention for athletes. Wearable devices track heart rate, movement patterns, and recovery metrics, while data analytics platforms provide insights into performance optimization. Video analysis, motion capture, and AI-assisted coaching tools enable precise evaluation of techniques, strategies, and biomechanics. Virtual and augmented reality systems are employed for simulation-based practice, enhancing spatial awareness and tactical understanding. Collaboration between sports scientists, engineers, and coaches ensures that technological solutions are practical, safe, and effective. National and international teams are integrating these innovations into daily training routines, improving efficiency and competitive advantage. Conferences and workshops highlight best practices, case studies, and emerging trends, fostering knowledge exchange. Overall, technology is transforming the sports ecosystem, enabling athletes to reach peak performance, reduce injury risk, and gain a competitive edge in national and international competitions.",
    "image": "https://via.placeholder.com/400x200",
    "category": "Sports",
    "subCategory": ["SportsTech", "Training", "Innovation"],
    "cardType": "sideImageCard",
    "isFeatured": false,
    "publishedDate": "2026-01-01"
  }
]


